src/DataProcessors/mega_ЗанятостьПроизводственныхРесурсов/mega_ЗанятостьПроизводственныхРесурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>mega_ЗанятостьПроизводственныхРесурсов</name>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПроизводственныеРесурсы</name>
    <attributes>
      <name>ПроизводственныйРесурс</name>
      <type>
        <types>CatalogRef.mega_ПроизводственныеРесурсы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/DataProcessors/mega_ЗанятостьПроизводственныхРесурсов/Forms/Форма/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	СформироватьОтчетНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ТаблицаДат()
	
	ОдинДень = 24*60*60;
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("ДатаРесурса", 
		Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
		
	ДатаРесурса = Объект.НачалоПериода;
	Пока ДатаРесурса <= Объект.КонецПериода Цикл
		
		НоваяСтрока = ТаблицаЗначений.Добавить();
		НоваяСтрока.ДатаРесурса = ДатаРесурса;
		
		ДатаРесурса = ДатаРесурса + ОдинДень;
	КонецЦикла;
	 
	Возврат ТаблицаЗначений;
КонецФункции

&НаСервере
Функция ТаблицаПроизводственныхРесурсов()
			
	ПроизводственныеРесурсы = Объект.ПроизводственныеРесурсы.Выгрузить();
	ПроизводственныеРесурсы.Свернуть("ПроизводственныйРесурс");
	 
	Возврат ПроизводственныеРесурсы;
КонецФункции

&НаСервере
Функция ПолучитьДанныеДляПостроенияДиаграммыГанта()
	
	ТаблицаДат = ТаблицаДат();
	ПроизводственныеРесурсы = ТаблицаПроизводственныхРесурсов();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДат.ДатаРесурса
		|ПОМЕСТИТЬ втТаблицаДат
		|ИЗ
		|	&ТаблицаДат КАК ТаблицаДат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПроизводственныеРесурсы.ПроизводственныйРесурс КАК Ресурс
		|ПОМЕСТИТЬ втПроизводственныеРесурсы
		|ИЗ
		|	&ПроизводственныеРесурсы КАК ПроизводственныеРесурсы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.ДатаРесурса,
		|	ВложенныйЗапрос.Ресурс
		|ПОМЕСТИТЬ втРесурсы
		|ИЗ
		|	(ВЫБРАТЬ
		|		втТаблицаДат.ДатаРесурса,
		|		втПроизводственныеРесурсы.Ресурс
		|	ИЗ
		|		втТаблицаДат КАК втТаблицаДат,
		|		втПроизводственныеРесурсы КАК втПроизводственныеРесурсы) КАК ВложенныйЗапрос
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Ресурс,
		|	ВложенныйЗапрос.ДатаРесурса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////				
		|ВЫБРАТЬ
		|	втРесурсы.ДатаРесурса КАК ДатаРесурса,
		|	втРесурсы.Ресурс КАК Ресурс,
		|	СУММА(ЕСТЬNULL(ПроизводственныеРесурсыОстатки.ВремяОстаток, 0)) КАК Остаток,
		|	СУММА(ЕСТЬNULL(ПроизводственныеРесурсыОстатки.Ресурс.Время, 0)) КАК Лимит
		|ИЗ
		|	втРесурсы КАК втРесурсы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.mega_ПроизводственныеРесурсы.Остатки(,) КАК ПроизводственныеРесурсыОстатки
		|		ПО втРесурсы.ДатаРесурса = ПроизводственныеРесурсыОстатки.ДатаРесурса
		|		И втРесурсы.Ресурс = ПроизводственныеРесурсыОстатки.Ресурс
		|СГРУППИРОВАТЬ ПО
		|	втРесурсы.ДатаРесурса,
		|	втРесурсы.Ресурс
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ресурс,
		|	ДатаРесурса
		|ИТОГИ
		|	СУММА(Остаток),
		|	СУММА(Лимит)
		|ПО
		|	Ресурс,
		|	ДатаРесурса";
		
	Запрос.УстановитьПараметр("ТаблицаДат", ТаблицаДат);
	Запрос.УстановитьПараметр("ПроизводственныеРесурсы", ПроизводственныеРесурсы);
			
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	Возврат ВыборкаДетальныеЗаписи;
КонецФункции

&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	Результат.Обновление = Ложь;	
	Результат.Очистить();
	
				
	ВыборкаРесурс = ПолучитьДанныеДляПостроенияДиаграммыГанта();
	Пока ВыборкаРесурс.Следующий() Цикл
		
		Точка = Результат.УстановитьТочку(ВыборкаРесурс.Ресурс);
		
		ВыборкаДатаРесурса = ВыборкаРесурс.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаДатаРесурса.Следующий() Цикл
			
			Серия = Результат.УстановитьСерию("Остаток");		

			Значение = Результат.ПолучитьЗначение(Точка, Серия);		
			Интервал = Значение.Добавить();
			Интервал.Текст = Строка(ВыборкаРесурс.Ресурс);		
			Интервал.Начало = НачалоДня(ВыборкаДатаРесурса.ДатаРесурса);
			Интервал.Конец = Интервал.Начало + ВыборкаДатаРесурса.Остаток;
			
			
//			Серия = Результат.УстановитьСерию("Лимит");		
//
//			Значение = Результат.ПолучитьЗначение(Точка, Серия);		
//			Интервал = Значение.Добавить();
//			Интервал.Текст = Строка(ВыборкаРесурс.Ресурс);		
//			Интервал.Начало = НачалоДня(ВыборкаДатаРесурса.ДатаРесурса);
//			Интервал.Конец = Интервал.Начало + (ВыборкаДатаРесурса.Лимит * 60*60);	
		КонецЦикла;	
	КонецЦикла;
	 
	
	Результат.Обновление = Истина;
	
КонецПроцедуры

#КонецОбласти
